Revit 2026 API

# AdvancedTransparentTransparentColor Property

---

The property labeled "Color" from the "AdvancedTransparent" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TransparentColor { get; }
```
```vb
Public Shared ReadOnly Property TransparentColor As String
	Get
```
```cpp
public:
static property String^ TransparentColor {
	String^ get ();
}
```
```fsharp
static member TransparentColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

AdvancedTransparent Class

Autodesk.Revit.DB.Visual Namespace